<?php  

	/**
	 * ----------------------------------------------------------------------
	 * 设置默认的编码
	 * ----------------------------------------------------------------------
	 * 默认全站的字符编码是UTF-8
	 */

	$config['charset'] = 'UTF-8';
	/**
	 * ----------------------------------------------------------------------
	 * 默认允许的url字符
	 * ----------------------------------------------------------------------
	 * 一般情况下保持默认的
	 */
	$config['permitted_uri_chars'] = 'a-zA-Z 0-9~%.:_\-';
	
	/**
	 * ----------------------------------------------------------------------
	 * 记录日志的等级
	 * ----------------------------------------------------------------------
	 *  ERROR 1
	 *  INFO  2
	 *  DEBUG 3	 
	 * 	ALL   4
	 * 在debug模 式下可以打出很多额外的log
	 */
	$config['log_write_level'] = '2'; 
	
	/**
	 * ---------------------------------------------------------------------
	 * log日志存放的地方，由于sae的不完善等各方面的因素，目前依旧存放在mysql中
	 * ---------------------------------------------------------------------
	 * 如果放在mysql中,需要建一个表logs
	 * 字段4个，id(auto_increament),log_time(timestamp),message,level
	 * 如果是存放在sae中，请在后台查看
	 * $config['log_place']='mysql','sae';
	 */
	$config['log_place'] = 'sae';
	$config['log_table'] = 'logs';
	
	/**
	 * ----------------------------------------------------------------------
	 * url 拆分的标志
	 * ----------------------------------------------------------------------
	 * 本框架只支持这种方式的url ，默认为 '/'
	 * /user/info/5/hema/ 表示 控制器user 模型info 参数 5 hema 
	 * /user-info-5-hema/ 表示的意义同上
	 * /user_info_5_hema/
	 * 
	 * 如果有其他的路由规则请在router.php中设置
	 */
	 $config['uri_segmentation'] = '/';
	 /**
	  * ---------------------------------------------------------------------
	  * 默认的action ，就是控制跳转器 ,默认为index
	  * ---------------------------------------------------------------------
	  */
	 $config['default_action'] ='Index';
	 
	 /**
	  * ---------------------------------------------------------------------
	  * 默认的method ，就是控制跳转器 ,默认为index
	  * ---------------------------------------------------------------------
	  */
	 $config['default_method'] = 'index';	 

	 